package SpringBoot;

public class study_01 {
    public static void main(String[] args) {
        // 스프링 부트는 새로운 기술이 아니라 스프링 프레임워크를 개선한것이다.
        // 스프링은 동작하는 외부 라이브러리를 일일이 찾아 연동 해야하지만 스프링부트는 미리 설정된 스타터 프로젝트로
        // 외부 라이브러리를 최적화해 제공한다.

        // Spring Boot 3.x는 java JDK 17 이상 지원한다.

        // 웹 서비스 동작
        // 클라이언트란? 서비스를 사용하는 프로그램 or 컴퓨터
        // 서버? 서비스를 제공하는 프로그램 or 컴퓨터

        // 뷰 템플릿? 화면을 담당하는 기술로, 웹 페이지를 하나의 틀로 만들고 여기로 변수롤 삽입해 다른 페이지를 보여준다.
        // Spring Boot 도구 중 Mustache라는 도구가 뷰 템플릿을 만드는 도구이다.
        
        // 뷰 템플릿은 간단히 뷰(View)라고도 한다.
        // View는 Controller와 Model 이라는 동료가 있다.
        // Controller? 클라이언트의 요청에 따라 서버에서 이를 처리하는 역할한다.
        // Model? 데이터를 관리하는 역할한다.
        // 이렇게 3가지 역할을 나누어서 활용하는 기법을 MVC 기법이라고 한다.
        
    }
}
